{
  "kind": "build_request",
  "title": "Update branding to “MALANCHA TAILORING TRAINING-CENTER” across UI, SEO metadata, and logo assets",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Replace the training center name text “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” with “MALANCHA TAILORING TRAINING-CENTER” everywhere it appears in the visible UI, including (at minimum) the header brand text, hero heading, footer heading, and copyright line.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Website ka name MALANCHA TAILORING TRAINING-CENTER KARDO",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Header brand text displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Hero main heading displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Footer training center name displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Copyright line uses “MALANCHA TAILORING TRAINING-CENTER”.",
        "No remaining visible instances of “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” appear anywhere on the page."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update SEO/sharing metadata in frontend/index.html to use “MALANCHA TAILORING TRAINING-CENTER” (document title, meta description text where the center name appears, Open Graph title, Twitter title, and any other metadata fields containing the old name). Keep all user-facing metadata text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Website ka name MALANCHA TAILORING TRAINING-CENTER KARDO",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "The <title> tag no longer contains “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” and includes “MALANCHA TAILORING TRAINING-CENTER”.",
        "og:title and twitter:title are updated to “MALANCHA TAILORING TRAINING-CENTER”.",
        "Any meta description content that contains the old name is updated to the new name.",
        "All updated metadata remains English-only."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Regenerate/update the brand logo and favicon image assets to include the name “MALANCHA TAILORING TRAINING-CENTER”, place them under frontend/public/assets/generated, and update all frontend references to use the new asset filenames (header logo, hero logo, favicon link, and social preview image if used). Also update logo alt text strings to reflect the new name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "New logo and favicon files exist under frontend/public/assets/generated with the exact filenames specified in imageRequirements.required.",
        "The header and hero logo <img> src values reference the new logo filename, and their alt text includes “MALANCHA TAILORING TRAINING-CENTER”.",
        "frontend/index.html favicon link references the new favicon filename.",
        "frontend/index.html og:image and twitter:image reference the new logo filename (or another newly generated social image if provided), with no remaining references to the old minakhan logo filenames."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/components/ui or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Keep backend minimal; no backend changes are required for this branding update."
  ],
  "nonGoals": [
    "Do not add new site sections or change the single-page layout structure.",
    "Do not add external integrations (email/SMS/shipping/analytics).",
    "Do not modify gallery images or contact form behavior as part of this change."
  ],
  "imageRequirements": {
    "required": [
      "Square training center logo with the text “MALANCHA TAILORING TRAINING-CENTER” (training-center-logo-malancha.dim_512x512.png)",
      "Simple favicon mark featuring the initials/mark for “MALANCHA TAILORING TRAINING-CENTER” (favicon-malancha.dim_64x64.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}