{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rebrand UI + metadata + assets to “MALANCHA TAILORING TRAINING-CENTER”",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Replace the training center name in all visible UI locations (header, hero, footer, copyright) to “MALANCHA TAILORING TRAINING-CENTER” and remove any remaining visible instances of the old name.",
      "acceptanceCriteria": [
        "Header brand text displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Hero main heading displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Footer training center name displays exactly “MALANCHA TAILORING TRAINING-CENTER”.",
        "Copyright line uses “MALANCHA TAILORING TRAINING-CENTER”.",
        "No remaining visible instances of “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” appear anywhere on the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update header brand text to exactly “MALANCHA TAILORING TRAINING-CENTER”, and ensure the header logo alt text uses the new name. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/TrainingCenterPage.tsx",
          "operation": "modify",
          "description": "Update hero heading text, footer heading, and footer copyright line to use “MALANCHA TAILORING TRAINING-CENTER” exactly everywhere the old name appears. Keep all user-facing text English-only. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update SEO/sharing metadata in frontend/index.html to use “MALANCHA TAILORING TRAINING-CENTER” in all fields that contain the old name, keeping metadata text English-only.",
      "acceptanceCriteria": [
        "The <title> tag no longer contains “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” and includes “MALANCHA TAILORING TRAINING-CENTER”.",
        "og:title and twitter:title are updated to “MALANCHA TAILORING TRAINING-CENTER”.",
        "Any meta description content that contains the old name is updated to the new name.",
        "All updated metadata remains English-only."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Replace occurrences of “MINAKHAN SKILL DEVELOPMENT TRAINING CENTER” in <title>, meta description (where present), og:title, and twitter:title with “MALANCHA TAILORING TRAINING-CENTER”. Ensure all metadata remains English-only. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add newly generated logo and favicon assets with required filenames under frontend/public/assets/generated, update all references (header/hero logos, favicon, social preview images), and update logo alt text to reflect the new name.",
      "acceptanceCriteria": [
        "New logo and favicon files exist under frontend/public/assets/generated with the exact filenames specified in imageRequirements.required.",
        "The header and hero logo <img> src values reference the new logo filename, and their alt text includes “MALANCHA TAILORING TRAINING-CENTER”.",
        "frontend/index.html favicon link references the new favicon filename.",
        "frontend/index.html og:image and twitter:image reference the new logo filename (or another newly generated social image if provided), with no remaining references to the old minakhan logo filenames."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/training-center-logo-malancha.dim_512x512.png",
          "operation": "create",
          "description": "Add the regenerated square training center logo image containing the text “MALANCHA TAILORING TRAINING-CENTER” with the exact required filename. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/public/assets/generated/favicon-malancha.dim_64x64.png",
          "operation": "create",
          "description": "Add the regenerated favicon mark image for “MALANCHA TAILORING TRAINING-CENTER” with the exact required filename. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update header logo <img> src to reference frontend/public/assets/generated/training-center-logo-malancha.dim_512x512.png and update alt text to include “MALANCHA TAILORING TRAINING-CENTER”. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/TrainingCenterPage.tsx",
          "operation": "modify",
          "description": "Update hero logo <img> src to reference frontend/public/assets/generated/training-center-logo-malancha.dim_512x512.png and update alt text to include “MALANCHA TAILORING TRAINING-CENTER”. Ensure no remaining references to prior logo filenames. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update favicon link to reference frontend/public/assets/generated/favicon-malancha.dim_64x64.png. Update og:image and twitter:image to reference frontend/public/assets/generated/training-center-logo-malancha.dim_512x512.png. Remove any remaining references to old minakhan logo filenames. (Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}